Repository: lawrancej/logisim
Catalog: xlate/ru/www/omegat-logisim-www_ru-level2.tmx
Source language: en_us
Languages: ru_ru

source: Actually, even though I use a low-power computer with a rather slow processor, I haven't noticed problems with how fast Logisim runs.
ru_ru: Вообще-то, даже если я использую маломощный компьютер с довольно медленным процессором, я не замечаю проблем с тем, как быстро работает Logisim.

source: With the generic .jar file: On Windows and MacOS systems, you will likely be able to start Logisim by double-clicking the JAR file.
ru_ru: Для общего .jar файла: На Windows и MacOS вы скорее всего сможете запустить Logisim двойным щелчком на JAR файле.

source: Argentina
ru_ru: Аргентина

source: Of course, I think it's the best choice.
ru_ru: Конечно, я считаю, что это лучший выбор.

source: Bulgaria
ru_ru: Болгария

source: (Copyright 2005, released under the GPL).
ru_ru: (Copyright 2005, выпущена под GPL).

source: Germany
ru_ru: Германия

source: PA
ru_ru: Пенсильвания

source: Czech Republic
ru_ru: Чешская республика

source: If this doesn't work for you for some reason, then you can e-mail me; be sure to include a truly descriptive subject line so that your message doesn't get lost among all the junk mail.
ru_ru: Если она не работает у вас по какой-то причине, то вы можете написать мне по электронной почте; не забудьте добавить правильное описание в поле Тема, чтобы ваше сообщение не затерялось в куче почты.

source: My rates are reasonable...
ru_ru: Мои расценки приемлемы...

source: Maybe.
ru_ru: Может быть.

source: See the GNU General Public License for more details.
ru_ru: См. Универсальную общественную лицензию GNU для более подробной информации.

source: Download software
ru_ru: Загрузка программного обеспечения

source: You might also find my more exhaustive outdated list useful.
ru_ru: Вы также можете найти полезным мой более исчерпывающий устаревший список (на английском).

source: If you want to talk about substantial commissions for doing particular work associated with Logisim, though, feel free to contact me.
ru_ru: Если же вы хотите поговорить о существенной комиссии за выполнение конкретной работы связанной с Logisim, не стесняйтесь связаться со мной.

source: India
ru_ru: Индия

source: There are all sorts of places where the program does horribly efficient things, like repainting the whole circuit every time you move the mouse, or allocating memory in many more situations than necessary.
ru_ru: Есть все виды мест, где программа делает жутко неэффективные вещи, такие как перерисовка всей схемы при каждом движении мыши или выделения памяти во многих ситуациях, когда это не необходимо.

source: JLS is a Java-based tool that is available at no cost from the author but is not open-source or freeware.
ru_ru: JLS - это Java-инструмент, доступный без требования платы со стороны автора, но он не с открытым исходным кодом и не свободен.

source: TkGate is open source software.
ru_ru: TkGate - ПО с открытым исходным кодом.

source: IA
ru_ru: Айова

source: (On a Macintosh, select from the Logisim menu.)
ru_ru: (На Macintosh выберите из меню Logisim.)

source: Using the Russian translation
ru_ru: Использование русского перевода

source: In the meantime, please reciprocate my generosity in releasing the program by politely wording suggestions for improvements.
ru_ru: В то же время, пожалуйста, ответьте взаимностью в виде вежливо сформулированных предложений на мою щедрость выпускать программу.

source: IL
ru_ru: Иллинойс

source: It is a fairly complete package, but it is no longer under development.
ru_ru: Это довольно полный пакет, но он уже не разрабатывается.

source: IN
ru_ru: Индиана

source: I don't have any plans to add the feature into Logisim.
ru_ru: У меня нет планов добавить эту возможность в Logisim.

source: 18 Jul 2007
ru_ru: 18 июля 2007

source: It's probably the most legitimate no-cost competitor to Logisim: It's simulation facilities seem quite sound, though the interface strikes me as rather awkward.
ru_ru: Это, пожалуй, самый достойный конкурент Logisim с нулевой стоимостью: его средства моделирования весьма впечатляют, хотя интерфейс кажется мне довольно неудобным.

source: I'd like to include your software with a textbook I'm publishing.
ru_ru: Я хотел бы включить ваше программное обеспечение в учебник, который я издаю.

source: With the Windows version: Just double-click the Logisim icon.
ru_ru: Для Windows версии: Просто дважды щелкните на значке Logisim.

source: With its simple toolbar interface and simulation of circuits as you build them, it is simple enough to facilitate learning the most basic concepts related to logic circuits.
ru_ru: Благодаря простому интерфейсу панели инструментов и моделированию схем по ходу их проектирования, Logisim достаточно прост, чтобы облегчить изучение основных понятий, связанных с логическими схемами.

source: A separate page outlines future plans.
ru_ru: Отдельная страница обрисовывает планы на будущее.

source: Brazil
ru_ru: Бразилия

source: Moving components attached to wires ``stretches'' the wires to maintain existing connections.
ru_ru: Перемещение компонентов, присоединённых к проводам "растягивает" провода для поддержания существующих соединений.

source: Compatible with versions Logisim 2.0 Beta 20 and later.
ru_ru: Совместима с версиями Logisim 2.0 Beta 20 и выше.

source: The more schools that contact me about using Logisim, the easier it will be for me to get support at my college to continue developing it.
ru_ru: Чем больше образовательных учреждений свяжутся со мной об использовании Logisim, тем легче будет мне получить поддержку в своём колледже для продолжения его разработки.

source: View documentation
ru_ru: Просмотр документации

source: User comments
ru_ru: Комментарии пользователей

source: This section contains libraries of components that can be imported into Logisim.
ru_ru: Этот раздел содержит библиотеки компонентов, которые могут быть импортированы в Logisim.

source: Incrementer example (JAR)
ru_ru: Пример счётчика (JAR)

source: Digital Simulator, closed source shareware, free for education
ru_ru: Digital Simulator, условно бесплатная программа с закрытым исходным кодом; бесплатна для образовательных целей.

source: The class name is com.cburch.incr.Components.
ru_ru: Имя класса - com.cburch.incr.Components.

source: If you do not already have it on your computer, Java is available from java.sun.com.
ru_ru: Если у вас её ещё нет на компьютере, то Java доступна на java.sun.com.

source: Logisim: Release history
ru_ru: Logisim: история выпусков

source: Select Russian from the Language drop-down menu.
ru_ru: Выберите Russian из выпадающего меню Language.

source: Australia
ru_ru: Австралия

source: It includes some support for incorporating VHDL specifications.
ru_ru: Он включает некоторую поддержку для привлечения VHDL спецификаций.

source: I suggest Catholic Relief Services.
ru_ru: Я предлагаю Католическую службу помощи.

source: But to answer your question: That would absolutely be OK per the terms of Logisim's license (the GNU public license).
ru_ru: Но отвечая на ваш вопрос: это совершенно нормально в соответствии с лицензией Logisim (Универсальной общественной лицензией GNU).

source: No: I already give my remaining salary - a substantial fraction of i - to charity as it is.
ru_ru: Нет: я и так отдаю своё жалование - существенную его часть - на благотворительность.

source: Version 2.0 is complete.
ru_ru: Версия 2.0 - завершённая.

source: Copyright and authorship
ru_ru: Авторское право и авторство

source: Questions and answers
ru_ru: Вопросы и ответы

source: Finland
ru_ru: Финляндия

source: Logisim: Download
ru_ru: Logisim: загрузка

source: The source code is available under the GNU Public License for version 2.0, Beta 16, or later.
ru_ru: Исходный код доступен в соответствии с Универсальной общественной лицензией GNU для версии 2.0, Beta 16 или более поздней версии.

source: Not included are courses that recommend Logisim without making explicit assignments nor those who offer a choice between Logisim and another piece of software.
ru_ru: Не включены курсы, которые рекомендуют Logisim, но не назначают явно, и те, которые предлагают выбор между Logisim и другим программным обеспечением.

source: KS
ru_ru: Канзас

source: United Kingdom
ru_ru: Великобритания

source: You may want to create a shortcut on the desktop and/or in the Start menu to make starting Logisim easier.
ru_ru: Вы можете создать ярлык на рабочем столе и/или в меню "Пуск", чтобы сделать запуск Logisim проще.

source: Text-based tools
ru_ru: Текстовые инструменты

source: A .jar file - runs on any platform, though not necessarily conveniently.
ru_ru: .jar файл - работает на любой платформе, правда он не всегда удобен.

source: Singapore
ru_ru: Сингапур

source: If you'd like to arrange to pay me substantial amounts of money, I'll be happy to entertain demands.
ru_ru: Если вы хотите заплатить мне значительную сумму денег, я буду счастлив удовлетворить запросы.

source: The simulation and library functionality is quite extensive, but the interface is on the awkward side.
ru_ru: Моделирование и функциональность библиотек весьма обширны, но интерфейс - не сильная его сторона.

source: Saudia Arabia
ru_ru: Саудовская Аравия

source: User can ``stretch'' using the Select Tool by dragging its handle after it is selected.
ru_ru: Пользователь может "растягивать" провод с помощью Инструмента Редактирования, перетаскивая его конец после выделения.

source: Logisim: Links
ru_ru: Logisim: ссылки

source: LogicSim, open source Java
ru_ru: LogicSim, с открытым исходным кодом, для Java
